Tekla Open API Reference for Tekla Structures 2025
Point.EPSILON_SQUARED Field
 A boundary value for comparing if two points are similar.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static readonly double EPSILON_SQUARED
Public Shared ReadOnly EPSILON_SQUARED As Double
Field Value
Type: Double
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace